[
  {
    "title": "Kadri Temple",
    "sneakPeek": "Ancient historical site.",
    "details": "-The Kadri Manjunatha Temple is the oldest shiva temple in Mangaluru, dating back to the 10th or 11th century.\n-It is known for its beautiful bronze statues and natural spring water tanks called 'Gomukhas'.\n-Also known for the unique ancient laterite structures known as the 'Pandava Caves'.",
    "externalLink": "https://karnatakatourism.org/en/attractions/kadri-manjunatha-temple",
    "imageName": "kadri_temple",
    "categoryName": "Temples"
  },
  {
    "title": "Kudroli Gokarnanath",
    "sneakPeek": "A magnificent temple built by Narayana Guru.",
    "details": "-Built in 1912 by the social reformer Narayana Guru for the Billava community.\n-Dedicated to Gokarnanatha, a form of Lord Shiva.\n-Famous for its grand 'Mangalore Dasara' celebrations where life-size idols of Navadurgas are displayed.\n-The temple features a unique architecture with golden gopurams and water tanks.",
    "externalLink": "https://mangalurusmartcity.net/tourism/kudroli-gokarnath-temple",
    "imageName": "kudroli_temple",
    "categoryName": "Temples"
  },
  {
    "title": "Mangaladevi Temple",
    "sneakPeek": "The historic temple that gave Mangalore its name.",
    "details": "-A 9th-century temple built by King Kundavarman of the Alupa dynasty.\n-The city of Mangalore is named after the presiding deity, Goddess Mangaladevi.\n-Built in the Kerala style of architecture with wooden pillars and sloping roofs.\n-It holds special significance for unmarried women who perform rituals here for a suitable match.",
    "externalLink": "https://www.mangaladevitemple.com/",
    "imageName": "mangaladevi_temple",
    "categoryName": "Temples"
  },
  {
    "title": "Sharavu Mahaganapathi",
    "sneakPeek": "An ancient Ganesha temple in the heart of the city.",
    "details": "-Located in Hampankatta, this temple is over 800 years old.\n-The name 'Sharavu' is derived from 'Shara' (arrow), linked to a legend involving Maharaja Veerabahu.\n-It is a major center for Yakshagana (traditional dance drama) and cultural activities.\n-Celebrates Ganesh Chaturthi and the Festival of Lights (Deepothsava) with great grandeur.",
    "externalLink": "https://www.sharavu.org/",
    "imageName": "sharavu_temple",
    "categoryName": "Temples"
  },
  {
    "title": "Kateel Durgaparameshwari",
    "sneakPeek": "A sacred temple situated on an islet in the Nandini River.",
    "details": "-Located about 26km from Mangalore, this temple is set amidst the scenic River Nandini.\n-Dedicated to Goddess Durga Parameshwari.\n-Famous for its Yakshagana troupe (Kateel Mela), which performs plays as an offering to the goddess.\n-The temple provides free meals (Annadhanam) to thousands of devotees daily.",
    "externalLink": "http://www.kateeldevi.in/",
    "imageName": "kateel_temple",
    "categoryName": "Temples"
  },
  {
    "title": "St. Aloysius Chapel",
    "sneakPeek": "Famous for its Sistine Chapel-style frescoes.",
    "details": "-Built in 1880 by Jesuit Missionaries on Lighthouse Hill.\n-Renowned for the magnificent paintings by Italian artist Antonio Moscheni that cover the walls and ceilings.\n-The frescoes depict the life of St. Aloysius Gonzaga and Jesus Christ.\n-It is often compared to the Sistine Chapel in Rome due to its artistic grandeur.",
    "externalLink": "https://staloysius.edu.in/st-aloysius-chapel",
    "imageName": "aloysius_chapel",
    "categoryName": "Churches"
  },
  {
    "title": "Rosario Cathedral",
    "sneakPeek": "The oldest church in Karnataka with a magnificent dome.",
    "details": "-Originally built by the Portuguese in 1568, making it the oldest church in the region.\n-The current structure (1910) features a massive dome modeled after St. Peter's Basilica in the Vatican.\n-It is the only church in the Mangalore Diocese with a dome over the sanctuary.\n-Historically, the cross on the dome was lit at night to serve as a beacon for seafarers.",
    "externalLink": "https://www.trawell.in/karnataka/mangalore/rosario-cathedral",
    "imageName": "rosario_cathedral",
    "categoryName": "Churches"
  },
  {
    "title": "Milagres Church",
    "sneakPeek": "A historic Roman Catholic church in Hampankatta.",
    "details": "-Built in 1680 by Bishop Thomas de Castro, it is one of the oldest churches in Dakshina Kannada.\n-Known for its beautiful white marble altar and Neo-Gothic architecture.\n-The original structure was destroyed by Tipu Sultan and rebuilt in 1784.\n-Dedicated to Our Lady of Miracles (Milagres).",
    "externalLink": "https://sunleisureworld.com/destination/india/mangalore/tour/top-attractions/831/milagres-church-an-ancient-roman-catholic-church",
    "imageName": "milagres_church",
    "categoryName": "Churches"
  },
  {
    "title": "Infant Jesus Shrine",
    "sneakPeek": "A powerful pilgrimage center known for miracles.",
    "details": "-Located in Bikarnakatte, this shrine is dedicated to the Infant Jesus of Prague.\n-Famous for its unique architecture featuring five huge columns representing the fingers of God's hand.\n-Thursdays are special days here, attracting thousands of devotees for mass and novena.\n-A place of deep spiritual solace situated on Carmel Hill.",
    "externalLink": "https://www.infantjesusmangalore.net/",
    "imageName": "infant_jesus_shrine",
    "categoryName": "Churches"
  },
  {
    "title": "St. Lawrence Church",
    "sneakPeek": "A serene parish surrounded by nature in Bondel.",
    "details": "-Located on the way to Bajpe Airport, known as a 'Bon Vale' (Good Valley) by early missionaries.\n-Dedicated to St. Lawrence, the patron saint of miracles.\n-Known for its peaceful ambiance, recent renovations, and beautiful altar.\n-Features a large open ground often used for community events and gatherings.",
    "externalLink": "http://bondelchurch.in/",
    "imageName": "st_lawrence_bondel",
    "categoryName": "Churches"
  },
  {
    "title": "Zeenath Baksh",
    "sneakPeek": "A unique wooden mosque dating back to 644 AD.",
    "details": "-Also known as the 'Beliye Palli', this is the 3rd oldest mosque in India.\n-Established by Arab traders around 644 AD.\n-Renovated by Tipu Sultan, who added the exquisite wooden pillars and carvings.\n-It is the only mosque in Karnataka made entirely of wood, showcasing rare Indian architectural styles.",
    "externalLink": "https://en.wikipedia.org/wiki/Masjid_Zeenath_Baksh",
    "imageName": "zeenath_baksh",
    "categoryName": "Mosques"
  },
  {
    "title": "Ullal Dargah",
    "sneakPeek": "A famous pilgrim center known for the Uroos festival.",
    "details": "-The tomb of the saint Syed Mohammad Sherifulla Madani, who came from Medina 400 years ago.\n-Located in Ullal, about 10km from the city center.\n-Famous for the 'Uroos' festival celebrated once every 5 years, which attracts thousands of pilgrims.\n-Believed to have miraculous healing powers for devotees of all faiths.",
    "externalLink": "https://www.seyyidmadaniullal.com/about.php",
    "imageName": "ullal_dargah",
    "categoryName": "Mosques"
  },
  {
    "title": "Idgah Mosque",
    "sneakPeek": "Historic mosque with panoramic city views.",
    "details": "-Built by Tipu Sultan in the 18th century on Light House Hill.\n-Holds great historical significance as a watchtower location for the Mysore Navy.\n-Offers a commanding view of the city and the Arabian Sea.\n-A major center for Eid prayers, gathering thousands of worshippers.",
    "externalLink": "https://tourmet.com/light-house-hill-garden-mangalore/",
    "imageName": "idgah_mosque",
    "categoryName": "Mosques"
  },
  {
    "title": "Jamia Masjid Kudroli",
    "sneakPeek": "Magnificent Mughal-style architecture.",
    "details": "-Renovated to resemble the famous Jama Masjid of Delhi.\n-Features towering 134-foot minarets and a massive dome.\n-A symbol of communal harmony, historically formed by uniting two twin mosques ('Jod Palli').\n-Located in the Kudroli area, it is one of the largest mosques in the region.",
    "externalLink": "https://www.mangaluruonline.in/guide/kudroli-mosque-in-mangalore",
    "imageName": "jamia_masjid_kudroli",
    "categoryName": "Mosques"
  },
  {
    "title": "Kudupu Ananthapadmanabha",
    "sneakPeek": "Famous for Naga Mandala and serpent worship.",
    "details": "-Located 10km from Mangalore on the Moodbidri route.\n-Dedicated to Lord Ananthapadmanabha (Vishnu) and famous for serpent worship (Naga Aradhana).\n-The temple has a holy pond called 'Bhadra Saraswathi Thirtha' on the left side.\n-Devotees perform 'Ashlesha Bali' here to ward off Sarpa Dosha.",
    "externalLink": "https://kuduputemple.com/",
    "imageName": "kudupu_temple",
    "categoryName": "Temples"
  },
  {
    "title": "Urwa Marigudi",
    "sneakPeek": "A powerful 800-year-old Goddess temple.",
    "details": "-The main deity is Goddess Mariyamma, believed to be the sister of Mangaladevi.\n-Built by the Mogaveera community around 800 years ago.\n-Fishermen offer gold pendants in the shape of fish/crabs/prawns when their prayers for a good catch are answered.\n-Famous for the 'Mari Pooje' festival.",
    "externalLink": "https://mangaloreheritage.com/temples/urwa-sri-mariyamma/",
    "imageName": "urwa_marigudi",
    "categoryName": "Temples"
  },
  {
    "title": "Polali Rajarajeshwari",
    "sneakPeek": "Home to a massive clay idol and the Chendu festival.",
    "details": "-An 8th-century temple located on the banks of the Phalguni river.\n-Famous for its 10-foot tall clay idol of the Goddess, which is historically believed to be 5000 years old.\n-Known for the unique 'Polali Chendu' (football) festival, a leather ball game played during the annual fair.\n-The temple architecture features intricate wooden carvings.",
    "externalLink": "https://www.polalitemple.in/",
    "imageName": "polali_temple",
    "categoryName": "Temples"
  },
  {
    "title": "Sri Venkataramana Temple",
    "sneakPeek": "The heart of the GSB community and the Car Festival.",
    "details": "-Sri Venkataramana Temple (SVT) is one of the most prominent temples in Mangalore.\n-Famous for the 'Kodial Teru' (Car Festival) held in Jan/Feb, which attracts thousands.\n-The temple follows the Madhwa Vaishnava tradition.\n-The main deity is Lord Veera Venkatesha Swamy.",
    "externalLink": "https://www.svtmangalore.com/",
    "imageName": "svt_carstreet",
    "categoryName": "Temples"
  },
  {
    "title": "Mukhyaprana Temple",
    "sneakPeek": "A powerful Hanuman temple located on Car Street.",
    "details": "-Located adjacent to the Sri Venkataramana Temple on Car Street.\n-Dedicated to Mukhyaprana (Hanuman) and established around 1804.\n-Devotees offer 'Vade Mala' (garland of vadas) and 'Rangapooja' here.\n-Known for its peaceful atmosphere and the belief that the deity fulfills all sincere wishes.",
    "externalLink": "https://www.svtmangalore.com/history/",
    "imageName": "mukhyaprana_carstreet",
    "categoryName": "Temples"
  },
  {
    "title": "Bappanadu Durgaparameshwari",
    "sneakPeek": "A symbol of communal harmony in Mulki.",
    "details": "-Located in Mulki, on the banks of the Shambhavi River.\n-Legend says the temple was built by a Muslim merchant named Bappa Beary, symbolizing communal harmony.\n-Famous for the 'Bappanadu Dolu', a massive drum beaten during festivals.\n-The main deity is worshipped in the form of a Linga.",
    "externalLink": "https://shivallibrahmins.com/tulunaadu-temples/mangalore-taluk/bappanadu-shri-durgaparameshwari-temple/",
    "imageName": "bappanadu_temple",
    "categoryName": "Temples"
  },
  {
    "title": "Kavoor Mahalingeshwara",
    "sneakPeek": "Ancient Shiva temple near a scenic lake.",
    "details": "-A historic temple dating back to the 13th-14th century, located in Kavoor.\n-Legend says it was founded by sage Maharshi Kavera.\n-Known for its grand 'Maha Shivaratri' celebrations and the annual 'Rathotsava' (Car Festival).\n-The temple premises include a large, serene lake.",
    "externalLink": "https://www.facebook.com/KavoorMahalingeshwara/",
    "imageName": "kavoor_mahalingeshwara",
    "categoryName": "Temples"
  },
  {
    "title": "Car Street Raghavendra Matha",
    "sneakPeek": "A major spiritual hub in the heart of the city.",
    "details": "-Located on Car Street (Ratha Beedhi) near the famous Venkataramana Temple.\n-Houses the 'Mrithika Brindavana' of Sri Raghavendra Swami.\n-A center for Dwaita philosophy, daily poojas, and 'Anna Santarpana' (free meals).\n-Part of the vibrant religious ecosystem of Mangalore's temple square.",
    "externalLink": "https://www.srsmatha.org/",
    "imageName": "raghavendra_matha_carstreet",
    "categoryName": "Temples"
  },
  {
    "title": "Kavoor Raghavendra Matha",
    "sneakPeek": "A serene and modern spiritual center.",
    "details": "-Located in the quiet suburb of Kavoor, distinct from the Car Street branch.\n-Recently renovated into a spacious complex with a modern community hall.\n-Offers a peaceful environment for meditation and prayer.\n-Known for special poojas on Thursdays and the annual Aradhana Mahotsava.",
    "externalLink": "https://www.google.com/maps/place/Sri+Raghavendra+Swamy+Mutt,+Kavoor",
    "imageName": "raghavendra_matha_kavoor",
    "categoryName": "Temples"
  },
  {
    "title": "Urwa Store Ganapathi",
    "sneakPeek": "A popular community temple for new beginnings.",
    "details": "-Located at the busy Urwa Store junction, serving as a landmark for locals.\n-Dedicated to Lord Ganesha (Mahaganapathi), the remover of obstacles.\n-Distinct from the Sharavu Ganapathi temple, this is a community-centric place of worship.\n-Famous for grand Ganesh Chaturthi celebrations and Sankashti Chaturthi poojas.",
    "externalLink": "https://www.google.com/maps/place/Shree+Mahaganapathi+Temple,+Urwa+Store",
    "imageName": "urwastore_ganapathi",
    "categoryName": "Temples"
  }
]
